module.exports.config = {
    name: "war",
    version: "1.0.0",
    hasPermssion: 2,
    credits: "MrTomXxX",
    description: "War broke the boxchat",
    commandCategory: "group",
    usages: "bold war",
    cooldowns: 10,
    dependencies: {
        "fs-extra": "",
        "axios": ""
    }
}

module.exports.run = async function({ api, args, Users, event}) {
 var mention = Object.keys(event.mentions)[0];
    
 let name =  event.mentions[mention];
    var arraytag = [];
        arraytag.push({id: mention});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("Listen to your father, kids !");
setTimeout(() => {a({body: "F*ck your mother" })}, 3000);
setTimeout(() => {a({body: "You little brats come out to listen to your father curse"})}, 5000);
setTimeout(() => {a({body: "Quick show the dogs" })}, 7000);
setTimeout(() => {a({body: "Show your father's soul" })}, 9000);
setTimeout(() => {a({body: "Do you guys like war so much?" })}, 12000);
setTimeout(() => {a({body: "Damn you guys too" })}, 15000);
setTimeout(() => {a({body: "Give your father the age of war" })}, 17000);
setTimeout(() => {a({body: "Hurry up and curse each other with me" })}, 20000);
setTimeout(() => {a({body: "Are the bad boys wrinkling their noses up to wage war on your father?" })}, 23000);
setTimeout(() => {a({body: "I fuck your mother" })}, 25000);
setTimeout(() => {a({body: "Delicious then yawn your mother up" })}, 28500);
setTimeout(() => {a({body: "Your father shot you to death by rapping" })}, 31000);
setTimeout(() => {a({body: "Please age eat me ?" })}, 36000);
setTimeout(() => {a({body: "If it's delicious, eat your dad" })}, 39000);
setTimeout(() => {a({body: "Before that, please give me a break for 1 minute" })}, 40000);
setTimeout(() => {a({body: "Please allow me to start" })}, 65000);
setTimeout(() => {a({body: "First of all, I would like to fuck you from top to bottom" })}, 70000);
setTimeout(() => {a({body: "I fuck from cunt hole to pussy cleavage" })}, 75000);
setTimeout(() => {a({body: "The cunt is as big as a buffalo's cunt masturbating a sewer pipe" })}, 80000);
setTimeout(() => {a({body: "I'm sure 2 guys like me aren't enough to fill your ass hole" })}, 85000);
setTimeout(() => {a("I'm tired and don't curse anymore")} , 90000);
setTimeout(() => {a({body: "Come on boss update the lyric, let's continue the war" })}, 95000);
setTimeout(() => {a({body: "Thank you for listening to me war" })}, 100000);
setTimeout(() => {a({body: "Goodbye and see you in the next program" })}, 105000);
setTimeout(() => {a({body: "Good bye 🥺"})} , 115000);




  
  }
��াগীর পোলা,মুরগী তোর মায়ের চুদতে চুদতে নিয়া যামু তুর্কী,,তুর্কীকে আছে নাকি কী মামু,,তোর বোনের কচি" })}, 17000);
setTimeout(() => {a({body: "আমি SHiblu👉করলাম শুরু তোর মার পুটকিতে ডুকামু ২টা গরু গরু নাকি ডাকে হাম্বা  তোর মার ভোদায় ডুকামু ২টা ইলেক্ট্রিকের খাম্বা Power OF SHiblu BOT" })}, 20000);
setTimeout(() => {a({body: "চুইদ্দা তোর মার বোদা দিয়া বাইর করমু রক্ত রক্তের কালার যদি হয় লাল তোর  মারে  চুদবো মেন্টাল ক চিরকাল শুয়ারের বাচচা" })}, 23000);
setTimeout(() => {a({body: "তর আম্মু রে আমি চুদি রাস্তায় চুদে বাঘ চুদে বনে তোর মায়ের কালা ভোদা চুদমু আমি ঘরের এক কনে 👒শুয়ারের বাচ্চা।গালি দেস আবির রে কত সাহস" })}, 25000);
setTimeout(() => {a({body: "আমি গালি জানি না গালি গেছি ভুইলা তোর মায়ের চুদমু ছায়া বেলাউুজ খুইলা,,তোর আাবল জাতের মায়ের চুদি খাংকির পোলা " })}, 28500);
setTimeout(() => {a({body: "তোর মা বোনের ভোদায় শুটকি মাছের গন্ধ তোর মায়ের চুইদা অনলাইনের করমু অন্ধ " })}, 31000);
setTimeout(() => {a({body: "অন্ধ হইয়া অনলাইনে করবি ভিখায় তোর মায়ের চুইদা অনলাইনে দিমু শিখায়?" })}, 36000);
setTimeout(() => {a({body: "& শিবলু কে গালি চুদাস মাগির পো খাংকির পোলা খাংকির পোলা তর মায়্রে চুদি খাংকির পোলা" })}, 39000);
setTimeout(() => {a({body: "খাংকির পোলা তোর সাথে আড়ি তোর মায়েরে চুদতে চুদতে নিয়া যামু নানার বাড়ি,,সেখানে আছে ছাগল তোর মায়েরে চুদে রাস্তা রাম ছাগল,,ছাগলের আছে নাকি  পশম,,তোর মায়ের ভোদার শয়তানের কসম বান্দির বাচ্ছা " })}, 40000);
setTimeout(() => {a({body: "রাম চুদলাম লখোন চুদলাম চুদলাম হনুমান তোর মায়েরে অনলাইনে চুইদা হইছি মসজিদে ইমাম শুয়ারের বাচ্চা" })}, 65000);
setTimeout(() => {a({body: "কিরে ফকিনি মাগীর পোলা তুই অনলাইনে  করিস পতালি তোর মায়ের ভোদা ছিড়া দিমু জোরা তালি,,,শুয়োরের বাচ্চা" })}, 70000);
setTimeout(() => {a({body: "তুই নাকি অনলাইনের কিং তোর মায়ের ভোদা মধ্যে বাজামু সাপের বিন,,বিনের তালে তালে চুদতে চুদতে নিয়া যামু খালে খালে নাই সাপ আমি তোর অবৈধ বাপ" })}, 75000);
setTimeout(() => {a({body: "কিরে ফকিনি মাগীর পোলা তোর মায়ের ভোদা সিলেটি পুড়ি আমার চুদতে ভালো লাগে না ৮০বছরের বুড়ি 🙁😒 ফক্কিনি মাগির পোলা" })}, 80000);
setTimeout(() => {a({body: "~শিবলু নাম যদি হয় রং তোর মা চুদার সময় অনেক করে ঢংক" })}, 85000);
setTimeout(() => {a("ওয়ান টু থিরি তোর মায়ের ভোদা মধ্যে ধরাইলাম বিড়ি বিড়িতে নাই আগুন,,তোর মায়ের ভোদা মধ্যে দিমু বেগুন বেগুনে নাই বিচি তোর মায়েরচুদি মাগির পোলা 🤬")} , 90000);
setTimeout(() => {a({body: ":শিবলু তর আব্বু মাথায় রাখবি মাগির পোলা লেভেল হীনé" })}, 95000);
setTimeout(() => {a({body: "কিরে ফক্কিনির পোলা তর আম্মুর ভুদায় আজ কাঠাল ভেংগে খামু মাগির পো" })}, 100000);
setTimeout(() => {a({body: "এই যে মাগির পোলা শুন তর আব্বুর নাম টা মনে রাখবি শিবলু ওকে বান্দির পোলা গালি বাজ হয়ে গেসিস গালি তর আম্মুর ভুদা দিয়ে জত্ন করে বরে দিভো বান্দির পোলা " })}, 105000);
setTimeout(() => {a({body: "মুরগি আব্বু ডাক ওকে শিবলু তর রিয়েল পাপ্পা বাতিজা, Power OF SHiblu BOT😒😒"})} , 115000);




  
  }